Merge pull request #98 from alexanderwanyoike/feature/persistant-state
feat: Add persistent state support for bots
